flow/flow.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2019-04-09 Tue 19:56 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Design and Flow of The molic Package</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="Mads Lindskou" />
</head>
<body>
<div id="content">
<h1 class="title">Design and Flow of The molic Package</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#orge4e78aa">1. C++ Sandbox</a></li>
<li><a href="#org2e056cb">2. Boost</a>
<ul>
<li><a href="#org5292f82">2.1. Graph</a></li>
<li><a href="#org53020ba">2.2. Sets</a></li>
</ul>
</li>
<li><a href="#org1274265">3. Lookup in containers</a></li>
<li><a href="#org950708f">4. Special Non-trivial R functions</a>
<ul>
<li><a href="#org833ef84">4.1. Make use of Rcpp syntax</a></li>
<li><a href="#org0f37cd7">4.2. <code>efs_init_.cpp</code></a>
<ul>
<li><a href="#org949f6cf">4.2.1. Named matrix</a></li>
<li><a href="#orga9026ee">4.2.2. Entropy2</a></li>
<li><a href="#orgac7d548">4.2.3. Hashtable (entropies)</a></li>
</ul>
</li>
<li><a href="#org739fa30">4.3. Connectivity components</a></li>
</ul>
</li>
<li><a href="#org1290a27">5. All Funtions</a></li>
</ul>
</div>
</div>


<div id="outline-container-orge4e78aa" class="outline-2">
<h2 id="orge4e78aa"><span class="section-number-2">1</span> C++ Sandbox</h2>
<div class="outline-text-2" id="text-1">
<div class="org-src-container">
<pre class="src src-C++"><span class="linenr">1: </span><span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">vector</span>&lt;<span style="color: #e9b2e3;">std</span>::string&gt; <span style="color: #fcaf3e;">x</span>;
<span class="linenr">2: </span>x.push_back(<span style="color: #e9b96e;">"This\n"</span>);
<span class="linenr">3: </span>x.push_back(<span style="color: #e9b96e;">"is\n"</span>);
<span class="linenr">4: </span>x.push_back(<span style="color: #e9b96e;">"Carsten!"</span>);
<span class="linenr">5: </span><span style="color: #b4fa70;">for</span>( <span style="color: #8cc4ff;">int</span> <span style="color: #fcaf3e;">i</span> = 0; i&lt;= 2; i++ ) {
<span class="linenr">6: </span>  <span style="color: #e9b2e3;">std</span>::cout &lt;&lt; x[i];
<span class="linenr">7: </span>}
</pre>
</div>

<pre class="example">
This
is
Carsten!

</pre>


<div class="org-src-container">
<pre class="src src-C++"><span class="linenr">1: </span><span style="color: #b4fa70;">typedef</span> <span style="color: #e9b2e3;">boost</span>::<span style="color: #8cc4ff;">adjacency_matrix</span>&lt;<span style="color: #e9b2e3;">boost</span>::directedS&gt; <span style="color: #8cc4ff;">Graph</span>;
<span class="linenr">2: </span><span style="color: #b4fa70;">const</span> <span style="color: #8cc4ff;">char</span>* <span style="color: #fcaf3e;">name</span> = <span style="color: #e9b96e;">"BC"</span>;
<span class="linenr">3: </span><span style="color: #8cc4ff;">Graph</span> <span style="color: #fce94f;">g</span>(N);
<span class="linenr">4: </span>add_edge(<span style="color: #e9b96e;">"B"</span>,<span style="color: #e9b96e;">"C"</span>, g);
<span class="linenr">5: </span><span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b96e;">"vertex set: "</span>;
<span class="linenr">6: </span><span style="color: #e9b2e3;">boost</span>::print_vertices(g, name);
<span class="linenr">7: </span><span style="color: #e9b2e3;">std</span>::cout &lt;&lt; <span style="color: #e9b2e3;">std</span>::endl;
</pre>
</div>
</div>
</div>


<div id="outline-container-org2e056cb" class="outline-2">
<h2 id="org2e056cb"><span class="section-number-2">2</span> Boost</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org5292f82" class="outline-3">
<h3 id="org5292f82"><span class="section-number-3">2.1</span> Graph</h3>
<div class="outline-text-3" id="text-2-1">
<ul class="org-ul">
<li><a href="https://www.youtube.com/watch?v=GSp2531Wti4">https://www.youtube.com/watch?v=GSp2531Wti4</a></li>
</ul>
</div>
</div>
<div id="outline-container-org53020ba" class="outline-3">
<h3 id="org53020ba"><span class="section-number-3">2.2</span> Sets</h3>
<div class="outline-text-3" id="text-2-2">
<ul class="org-ul">
<li>STL : <a href="http://www.cplusplus.com/reference/algorithm/set_union/">http://www.cplusplus.com/reference/algorithm/set_union/</a></li>
<li>BOOST :</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-org1274265" class="outline-2">
<h2 id="org1274265"><span class="section-number-2">3</span> Lookup in containers</h2>
<div class="outline-text-2" id="text-3">
<p>
The point where maps become faster than vectors depends on the implementation, on your processor, what data is in the map, and subtle things like what memory is in the processor's cache. Typically, the point where map becomes faster would be about 5-30 elements. 
</p>
<ul class="org-ul">
<li><a href="https://stackoverflow.com/questions/454762/vector-or-map-which-one-to-use">https://stackoverflow.com/questions/454762/vector-or-map-which-one-to-use</a></li>
</ul>
</div>
</div>

<div id="outline-container-org950708f" class="outline-2">
<h2 id="org950708f"><span class="section-number-2">4</span> Special Non-trivial R functions</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org833ef84" class="outline-3">
<h3 id="org833ef84"><span class="section-number-3">4.1</span> Make use of Rcpp syntax</h3>
<div class="outline-text-3" id="text-4-1">
<p>
Tell g++ where the Rcpp header is
</p>
<ul class="org-ul">
<li><p>
<a href="http://mazamascience.com/WorkingWithData/?p=1125">http://mazamascience.com/WorkingWithData/?p=1125</a>
</p>

<p>
For more complicated parts, consider using Rcpp.
</p></li>
<li>for <code>table</code>, <code>math</code> etc: <a href="http://adv-r.had.co.nz/Rcpp.html">http://adv-r.had.co.nz/Rcpp.html</a></li>
</ul>
<div class="org-src-container">
<pre class="src src-R"><span class="linenr">1: </span>std::unordered_map<span style="color: #e9b2e3;">&lt;</span> int, std::string <span style="color: #e9b2e3;">&gt;</span> my_map;
</pre>
</div>
<ul class="org-ul">
<li>named vectors (if not implemented myself): <a href="https://cran.r-project.org/web/packages/Rcpp/vignettes/Rcpp-quickref.pdf">https://cran.r-project.org/web/packages/Rcpp/vignettes/Rcpp-quickref.pdf</a></li>
<li>string vectors: <a href="http://gallery.rcpp.org/articles/working-with-Rcpp-StringVector/">http://gallery.rcpp.org/articles/working-with-Rcpp-StringVector/</a></li>
<li>sort strings: <a href="http://gallery.rcpp.org/articles/strings_with_rcpp/">http://gallery.rcpp.org/articles/strings_with_rcpp/</a></li>
</ul>
</div>
</div>

<div id="outline-container-org0f37cd7" class="outline-3">
<h3 id="org0f37cd7"><span class="section-number-3">4.2</span> <code>efs_init_.cpp</code></h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-org949f6cf" class="outline-4">
<h4 id="org949f6cf"><span class="section-number-4">4.2.1</span> Named matrix</h4>
<div class="outline-text-4" id="text-4-2-1">
<p>
Use <code>Armadillo</code> with <code>pair</code>. Make a struct called <code>name_mat</code> or <code>efs_mat</code>.
</p>
</div>
</div>

<div id="outline-container-orga9026ee" class="outline-4">
<h4 id="orga9026ee"><span class="section-number-4">4.2.2</span> Entropy2</h4>
<div class="outline-text-4" id="text-4-2-2">
<p>
We need a function to paste all rows, and make a table of counts.
</p>
<div class="org-src-container">
<pre class="src src-R"><span class="linenr">1: </span><span style="color: #73d216;"># </span><span style="color: #73d216;">https://thecoatlessprofessor.com/programming/porting-rs-table-function-to-c--/</span>
</pre>
</div>
</div>
</div>

<div id="outline-container-orgac7d548" class="outline-4">
<h4 id="orgac7d548"><span class="section-number-4">4.2.3</span> Hashtable (entropies)</h4>
<div class="outline-text-4" id="text-4-2-3">
<div class="org-src-container">
<pre class="src src-cpp"><span class="linenr">1: </span><span style="color: #e9b2e3;">std</span>::<span style="color: #8cc4ff;">unordered_map</span>&lt; <span style="color: #8cc4ff;">int</span>, <span style="color: #e9b2e3;">std</span>::string &gt; <span style="color: #fcaf3e;">my_map</span>;
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org739fa30" class="outline-3">
<h3 id="org739fa30"><span class="section-number-3">4.3</span> Connectivity components</h3>
</div>
</div>

<div id="outline-container-org1290a27" class="outline-2">
<h2 id="org1290a27"><span class="section-number-2">5</span> All Funtions</h2>
<div class="outline-text-2" id="text-5">
<table border="2" cellspacing="0" cellpadding="6" rules="all" frame="border">


<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />
</colgroup>

<colgroup>
<col  class="org-left" />

<col  class="org-left" />
</colgroup>
<thead>
<tr>
<th scope="col" class="org-left">func</th>
<th scope="col" class="org-left">file</th>
<th scope="col" class="org-left">C++</th>
<th scope="col" class="org-left">func</th>
<th scope="col" class="org-left">file</th>
<th scope="col" class="org-left">C++</th>
</tr>
</thead>
<tbody>
<tr>
<td class="org-left">na</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">na_efs</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">na_b</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\vee\)</td>
<td class="org-left">entropy</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">na_ya</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\vee\)</td>
<td class="org-left">entropy2</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">Make it use na</td>
</tr>

<tr>
<td class="org-left">a_marginals</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\((\vee)\)</td>
<td class="org-left">metric</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">xlogx</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">current_eligible_edges</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">x1logx1</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">edges_to_delete</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">TY</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">update_edges_from_C_primes_to_Cab</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">If possible</td>
</tr>

<tr>
<td class="org-left">simulate_TY</td>
<td class="org-left">outlier_utils.R</td>
<td class="org-left">\(\vee\)</td>
<td class="org-left">which_Cp_from_Cx_to_Cab</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">neq_empt_chr</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">make_G_dbl_prime</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">If possible</td>
</tr>

<tr>
<td class="org-left">neq_empt_int</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">is_all_eligibles_present</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">&#xa0;</td>
</tr>

<tr>
<td class="org-left">neq_empt_lst</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">mdl</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">neq_empt_num</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">efs_init</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">If possible</td>
</tr>

<tr>
<td class="org-left">neq_null</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">efs_step</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">If possible</td>
</tr>

<tr>
<td class="org-left">es_to_vs</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">nhood</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">rev_es</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">mcs</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">vs_to_es</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">perfect_sequence</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">sort_</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\(\div\)</td>
<td class="org-left">cliques</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">is_Cx</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\((\vee)\)</td>
<td class="org-left">separators</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">is_Ca_and_Cb</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\((\vee)\)</td>
<td class="org-left">rip</td>
<td class="org-left">rip.R</td>
<td class="org-left">\(\vee\)</td>
</tr>

<tr>
<td class="org-left">is_Ca_or_Cb</td>
<td class="org-left">efs_utils.R</td>
<td class="org-left">\((\vee)\)</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
<td class="org-left">&#xa0;</td>
</tr>
</tbody>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Mads Lindskou</p>
<p class="date">Created: 2019-04-09 Tue 19:56</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
